Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ОстаткиТоваров.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеТоваровТовары.Номенклатура КАК Номенклатура,
		|	СУММА(СписаниеТоваровТовары.Количество) КАК КоличествоДокумент
		|ПОМЕСТИТЬ ТоварыДокумента
		|ИЗ
		|	Документ.СписаниеТоваров.Товары КАК СписаниеТоваровТовары
		|ГДЕ
		|	СписаниеТоваровТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СписаниеТоваровТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыДокумента.Номенклатура КАК Номенклатура,
		|	ТоварыДокумента.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	ТоварыДокумента.КоличествоДокумент КАК КоличествоДокумент,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
		|ИЗ
		|	ТоварыДокумента КАК ТоварыДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(&МоментВремени, Склад = &Склад) КАК ОстаткиТоваровОстатки
		|		ПО ТоварыДокумента.Номенклатура = ОстаткиТоваровОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад); 	
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		Запрос.УстановитьПараметр("МоментВремени", Неопределено);
	Иначе 
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаДвижений = Новый ТаблицаЗначений;
	ТаблицаДвижений.Колонки.Добавить("Номенклатура");
	ТаблицаДвижений.Колонки.Добавить("Количество");
	
	//  Проверка остатков в цикле
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.КоличествоДокумент > Выборка.КоличествоОстаток Тогда
			
			Нехватка = Выборка.КоличествоДокумент - Выборка.КоличествоОстаток;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Ошибка! На складе не хватает номенклатуры '%1'. Требуется: %2, в наличии: %3 (Нехватка: %4)", 
				Выборка.НоменклатураНаименование, Выборка.КоличествоДокумент, Выборка.КоличествоОстаток, Нехватка);
			
			Сообщение.Текст = Сообщение.Текст;
			
			Сообщение.Сообщить();
			
			Отказ = Истина;
		КонецЕсли;
		
		Если Не Отказ Тогда
			НовоеДвижение = ТаблицаДвижений.Добавить();
			НовоеДвижение.Номенклатура = Выборка.Номенклатура;
			НовоеДвижение.Количество = Выборка.КоличествоДокумент;
		КонецЕсли;
		
	КонецЦикла;
	
	// Записываем списание ТОЛЬКО если нет ошибок
	Если Не Отказ Тогда
		Для Каждого СтрДвижения Из ТаблицаДвижений Цикл
			Движение = Движения.ОстаткиТоваров.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Склад = Склад; 
			Движение.Номенклатура = СтрДвижения.Номенклатура;
			Движение.Количество = СтрДвижения.Количество;
		КонецЦикла;
	Иначе
		Движения.ОстаткиТоваров.Записывать = Ложь;
	КонецЕсли;
	
КонецПроцедуры
