&НаКлиенте
Процедура НоменклатураКоличествоПриИзменении(Элемент)
	СтрокаТаблицы = Элементы.Номенклатура.ТекущиеДанные;
	ПересчитатьСтроку(СтрокаТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураЦенаПриИзменении(Элемент)
	СтрокаТаблицы = Элементы.Номенклатура.ТекущиеДанные;
	ПересчитатьСтроку(СтрокаТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтроку(СтрокаТаблицы)
	// Автоматически считаем итоговую стоимость по строчке оборудования
	СтрокаТаблицы.Сумма = СтрокаТаблицы.Цена * СтрокаТаблицы.Количество;
КонецПроцедуры

  