Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Очищаем старые движения регистра ОстаткиТоваров
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ОстаткиТоваров.Очистить();
	
	// Цикл обхода всех строк табличной части "Товары"
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		// Для каждой строки документа создаем запись (Приход) в регистр остатков
		Движение = Движения.ОстаткиТоваров.ДобавитьПриход();
		
		Движение.Период = Дата;
		Движение.Склад = Склад; // Берется из шапки документа
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура; 
		Движение.Количество = ТекСтрокаТовары.Количество;  
		
	КонецЦикла;
	
КонецПроцедуры
